// -------------------------------------------------------------
// エリア総和テーブル
// 
// Copyright (c) 2003 IMAGIRE Takashi. All rights reserved.
// -------------------------------------------------------------

// -------------------------------------------------------------
// グローバル変数
// -------------------------------------------------------------

float  MAP_WIDTH;	// SAT の幅
float  MAP_HEIGHT;	// SAT の高さ

float SIZE = 40.0f;	// ぼかす量
float INV_SIZE2=1.0f/(40.0f*40.0f);	// ぼかす量の逆２乗

// -------------------------------------------------------------
// テクスチャ
// -------------------------------------------------------------
texture SrcMap;
sampler SrcSamp = sampler_state
{
    Texture = <SrcMap>;
    MinFilter = POINT;
    MagFilter = POINT;
    MipFilter = NONE;

    AddressU = Clamp;
    AddressV = Clamp;
};
// -------------------------------------------------------------
// 頂点シェーダからピクセルシェーダに渡すデータ
// -------------------------------------------------------------
struct VS_OUTPUT
{
    float4 Pos			: POSITION;
    float2 ofset		: COLOR0;
	float2 Tex0			: TEXCOORD0;
	float2 Tex1			: TEXCOORD1;
	float2 Tex2			: TEXCOORD2;
	float2 Tex3			: TEXCOORD3;
};

// -------------------------------------------------------------
// -------------------------------------------------------------
// エリア総和テーブルの作成
// -------------------------------------------------------------
// -------------------------------------------------------------

// -------------------------------------------------------------
// 頂点シェーダプログラム
// 0.5シフト＝ 中心合わせ（POINTでも安定サンプル）
// 1.0 シフト＝境界位置（ LINEARなら50:50だが、 POINTなら依然として最近傍で安定しない）
// バイリニア化したいなら Min/MagFilter をLINEAR にする必要があります。
// -------------------------------------------------------------
VS_OUTPUT VS_sat_x (
      float4 Pos    : POSITION,          // モデルの頂点
      float4 Tex    : TEXCOORD0	         // テクスチャ座標
){
    VS_OUTPUT Out = (VS_OUTPUT)0;        // 出力データ
    
    // 位置座標
    Out.Pos = Pos;
    
    // テクスチャ座標
    Out.Tex0 = Tex + float2( 0.5f/MAP_WIDTH, 0.5f/MAP_HEIGHT );
    Out.Tex1 = Tex + float2(-0.5f/MAP_WIDTH, 0.5f/MAP_HEIGHT );// 左
    
    // 参考書では全部1とあるが厳密には画素の色になるため必ずしも1ではない
    // 1,1,1,1
    // 1,1,1,1
    
    // ↓
    // 1,2,3,4
    // 1,2,3,4となる
    
    return Out;
}

// -------------------------------------------------------------
// 頂点シェーダプログラム
// -------------------------------------------------------------
VS_OUTPUT VS_sat_y (
      float4 Pos    : POSITION,          // モデルの頂点
      float4 Tex    : TEXCOORD0	         // テクスチャ座標
){
    VS_OUTPUT Out = (VS_OUTPUT)0;        // 出力データ
    
    // 位置座標
    Out.Pos = Pos;
    
    // テクスチャ座標
    Out.Tex0 = Tex + float2( 0.5f/MAP_WIDTH, 0.5f/MAP_HEIGHT );
    Out.Tex1 = Tex + float2( 0.5f/MAP_WIDTH,-0.5f/MAP_HEIGHT );// 上
    
    return Out;
}

// -------------------------------------------------------------
// ピクセルシェーダプログラム
// -------------------------------------------------------------
float4 PS_sat(VS_OUTPUT In) : COLOR
{   
    float4 Color;
	
	Color  = tex2D( SrcSamp, In.Tex0 )
               + tex2D( SrcSamp, In.Tex1 );
	
    // エリア総和テーブルの値が飽和しないように-0.5する
    // 最終出力時に0.5を加算して0~1の範囲に戻す
    return Color-0.5f;
}

// -------------------------------------------------------------
// -------------------------------------------------------------
// 最終出力
// -------------------------------------------------------------
// -------------------------------------------------------------

// -------------------------------------------------------------
// 頂点シェーダプログラム
// -------------------------------------------------------------
VS_OUTPUT VS_out (
      float4 Pos    : POSITION,          // モデルの頂点
      float4 Tex    : TEXCOORD0	         // テクスチャ座標
){
    VS_OUTPUT Out = (VS_OUTPUT)0;        // 出力データ
    
    // 位置座標
    Out.Pos = Pos;
    
    Out.Tex0 = Tex + float2( (-0.5f-0.5f*SIZE)/MAP_WIDTH
                           , (-0.5f-0.5f*SIZE)/MAP_HEIGHT );// 左上
    
    Out.Tex1 = Tex + float2( (-0.5f-0.5f*SIZE)/MAP_WIDTH
                           , (-0.5f+0.5f*SIZE)/MAP_HEIGHT );// 左下
    
    Out.Tex2 = Tex + float2( (-0.5f+0.5f*SIZE)/MAP_WIDTH
                           , (-0.5f-0.5f*SIZE)/MAP_HEIGHT );// 右上
    
    Out.Tex3 = Tex + float2( (-0.5f+0.5f*SIZE)/MAP_WIDTH
                           , (-0.5f+0.5f*SIZE)/MAP_HEIGHT );// 右下
    
    return Out;
}

// -------------------------------------------------------------
// ピクセルシェーダプログラム
// -------------------------------------------------------------
float4 PS_out(VS_OUTPUT In) : COLOR
{   
    float4 Color;
    
    // エリア総和テーブルで使える四角形の範囲内にあるテクセルカラーの平均をとれる公式
    // (A - B - C + D) / (a x b)：四角形のサイズで割る
    Color  =( tex2D( SrcSamp, In.Tex0 )
            - tex2D( SrcSamp, In.Tex1 )
            - tex2D( SrcSamp, In.Tex2 )
            + tex2D( SrcSamp, In.Tex3)) / (SIZE * SIZE);

    // 最後に0~1の範囲に戻すために0.5を加算
    return Color+0.5f;
}

// -------------------------------------------------------------
// テクニック
// -------------------------------------------------------------
technique TShader
{
    pass P0
    {
		// -----------------------------------------------------
		// X軸ぼかし
		// -----------------------------------------------------
        VertexShader = compile vs_1_1 VS_sat_x();
        PixelShader  = compile ps_2_0 PS_sat();
    }
    pass P1
    {
		// -----------------------------------------------------
		// Y軸ぼかし
		// -----------------------------------------------------
        VertexShader = compile vs_1_1 VS_sat_y();
        PixelShader = compile ps_2_0 PS_sat();
    }
    pass P2
    {
		// -----------------------------------------------------
		// 出力
		// -----------------------------------------------------
        VertexShader = compile vs_1_1 VS_out();
        PixelShader = compile ps_2_0 PS_out();
    }
}
